Revit 2027 API
Wire.AreVertexPointsValid Method
 Checks if the given vertex points are valid for the wire.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreVertexPointsValid(
	IList<XYZ> vertexPoints,
	Connector startConnector,
	Connector endConnector
)
Public Shared Function AreVertexPointsValid (
	vertexPoints As IList(Of XYZ),
	startConnector As Connector,
	endConnector As Connector
) As Boolean
public:
static bool AreVertexPointsValid(
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnector,
	Connector^ endConnector
)
static member AreVertexPointsValid :
        vertexPoints : IList<XYZ> *
        startConnector : Connector *
        endConnector : Connector -> bool
Parameters
vertexPoints IList<XYZ>
 The vertex points.
startConnector Connector
 The start connector of the wire.
endConnector Connector
 The end connector of the wire.
Return Value
Boolean
 True if the given vertex points are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 X and Y values are compared of the vertices.
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace